package CodingInterviews_64_Accumulate;

/*
	面试题64：求1+2+…+n
		求1+2+…+n，要求不能使用乘除法、for、while、if、else、switch、case
		等关键字及条件判断语句（A?B:C）。
 */
public class Accumulate {
	public int Sum_Solution(int n) {
		return n * (n + 1) / 2;
	}

	// cpp版本改写
	// ====================方法一====================
	// 利用构造函数求解，通过构造n个对象的同时将加n次

	// ====================方法二====================
	// 利用虚函数求解

	// ====================方法三====================
	// 利用函数指针求解

	// ====================方法四====================
	// 利用模板类型求解

}
